<template>
  <div class="main">
    <el-divider>简单的时间线</el-divider>
    <div class="block">
      <el-timeline>
        <el-timeline-item v-for="(activity, index) in activities" :key="index" :icon="activity.icon"
          :type="activity.type" :color="activity.color" :size="activity.size" :timestamp="activity.timestamp">
          {{activity.content}}
        </el-timeline-item>
      </el-timeline>
    </div>
    <el-divider>带卡片的时间线</el-divider>
    <div class="block">
  <el-timeline>
    <el-timeline-item timestamp="2018/4/12" placement="top" color="red" :hide-timestamp="true">
      <el-card>
        <h4>更新 Github 模板</h4>
        <p>王小虎 提交于 2018/4/12 20:46</p>
      </el-card>
    </el-timeline-item>
    <el-timeline-item timestamp="2018/4/3" placement="bottom">
      <el-card>
        <p>一年前</p>
        <h4>更新 Github 模板</h4>
        <p>王小虎 提交于 2018/4/3 20:46</p>
      </el-card>
    </el-timeline-item>
    <el-timeline-item timestamp="2018/4/2" placement="top" type="info" color="blue" size="large" icon='el-icon-circle-plus-outline'>
      <el-card>
        <h4>更新 Github 模板</h4>
        <p>王小虎 提交于 2018/4/2 20:46</p>
      </el-card>
    </el-timeline-item>
  </el-timeline>
</div>
  </div>
</template>
<script>
export default {
  data () {
    return {
      activities: [
        {
          content: '支持使用图标',
          timestamp: '2018-04-12 20:46',
          size: 'large',
          type: 'primary',
          icon: 'el-icon-more'
        },
        {
          content: '支持自定义颜色',
          timestamp: '2018-04-03 20:46',
          color: '#0bbd87'
        },
        {
          content: '支持自定义尺寸，这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容',
          timestamp: '2018-04-03 20:46',
          size: 'large'
        },
        {
          content: '默认样式的节点,这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容这是一段默认的内容说',
          timestamp: '2018-04-03 20:46'
        }
      ]
    }
  }
}
</script>
<style lang="less">
@import url('./index.less');
</style>
